{
  "Title": "No Rules Rules",
  "Status": "Not started",
  "Pages": 0,
  "Progress": 0,
  "Started On": "",
  "Finished On": "",
  "Author": [
    "Reed Hastings",
    "Erin Meyer"
  ],
  "Collection": "",
  "Genre": "",
  "Format": "Physical",
  "ISBN": "9780753553664",
  "Cover": "http://books.google.com/books/content?id=j5LBwQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
  "Summary": "\"Netflix cofounder Reed Hastings reveals for the first time the unorthodox culture behind one of the world's most innovative, imaginative, and successful companies There's never before been a company like Netflix. Not only because it has led a revolution in the entertainment industries; or because it generates billions of dollars in annual revenue; or even because it is watched by hundreds of millions of people in nearly 200 countries. When Reed Hastings co-founded Netflix, he developed a set of counterintuitive and radical management principles, defying all tradition and expectation, which would allow the company to reinvent itself over and over on the way to becoming one of the most loved brands in the world. Rejecting the conventional wisdom under which other companies operate, Reed set new standards, valuing people over process, emphasizing innovation over efficiency, and giving employees context, not controls. At Netflix, adequate performance gets a generous severance and hard work is irrelevant. At Netflix, you don't try to please your boss, you practice radical candor instead. At Netflix, employees never need approval, and the company always pays top of market. When Hastings and his team first devised these principles, the implications were unknown and untested, but over just a short period of time they have led to unprecedented flexibility, speed, and boldness. The culture of freedom and responsibility has allowed the company to constantly grow and change as the world, and its members' needs, have also transformed. Here for the first time, Hastings and Erin Meyer, bestselling author of The Culture Map and one of the world's most influential business thinkers, dive deep into the controversial philosophies at the heart of the Netflix psyche, which have generated results that are the envy of the business world. Drawing on hundreds of interviews with current and past Netflix employees from around the globe and never-before-told stories of trial and error from his own career, No Rules Rules is the full, fascinating, and untold story of a unique company making its mark on the world\"--Provided by publisher."
}