{
  "Title": "Total Competition",
  "Status": "Not started",
  "Pages": 0,
  "Progress": 0,
  "Author": [
    "Ross Brawn",
    "Adam Parr"
  ],
  "Format": "Physical",
  "ISBN": "9781471162381",
  "Cover": "http://books.google.com/books/content?id=SHRIvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
  "Summary": "From Ross Brawn—one of the most successful figures in Formula One auto racing—comes a compelling insider’s account of what it takes to win, featuring practical advice for overcoming obstacles and becoming a champion both on and off the racetrack. Formula One racing is a wildly popular global sport with millions of fans and billions more engineering dollars at stake. For four decades, Ross Brawn has been one of the most innovative technical directors and team principals in the high-stakes world of Formula One. He is considered the most successful competitor in the history of Formula One to date, and “the closest thing there is to a certifiable genius” (The Wall Street Journal). Leading Benetton, Ferrari, Honda, and Mercedes, he has worked with legendary drivers such as Michael Schumacher, Jenson Button, and Lewis Hamilton to make them Grand Prix champions. Now, in this fascinating book, presented as a frank conversation between Brawn and fellow Formula One competitor Adam Parr, Brawn reflects upon his career, shares the philosophies and methods that led to his success, and offers lessons that every leader working with teams—at work, play, or home—can use to achieve their own goals, too. Brawn and Parr share details about the unique pressures of Formula One racing and the intense, cutthroat world they inhabited, where coming in second place is never good enough. Just as Phil Knight recounted his accomplishments and devastating setbacks in the building of the Nike brand in the New York Times bestseller Shoe Dog, this book also provides a blueprint for leading teams, imparting lessons such as “Embrace Humility,” “Invest in People and Culture,” “Strive for Simplicity, Manage Complexity,” and much more."
}