{
  "Title": "Cloud Strategy",
  "Status": "Not started",
  "Pages": 329,
  "Progress": 0,
  "Author": [
    "Gregor Hohpe"
  ],
  "Format": "Physical",
  "ISBN": "9798708945129",
  "Cover": "",
  "Summary": "\"Strategy is the difference between making a wish and making it come true.\" Most books on cloud computing either stay at a very high level, offer simplistic recipes, or dive deep into vendor-specific product details. This book helps you fill the very large space in between: aligning technology change with organizational transformation, making architectural decisions, and communicating trade-offs to diverse stakeholders. The book balances structured decision models with real-life anecdotes, both harvested from half a decade of defining and implementing cloud strategies for major organizations. Today's enterprises need a more nuanced strategy than simply proclaiming \"cloud first!\" A strategy isn't something you can copy-paste from a recipe book or from another organization, though: diverse starting points, objectives, and constraints imply different choices and trade-offs. So, rather than offering \"proven-3-step-recipes\" or touting shallow success stories, this book helps you chart your own strategy by helping you ask the right questions and connecting the dots between the many facets of cloud computing. Your journey will cover why cloud lives in the first derivative, why it's not just about infrastructure, how to organize for successful cloud migrations, understanding hybrid and multi-cloud architectures without vendor jargon, designing cloud-native applications, and optimizing for cost-efficient and resilient operations. Being free of jargon and product pitches, this book is a valuable guide for: Enterprise and cloud architects who are tasked with defining and communicating a credible cloud strategy Consultants and advisors who rely on evocative decision models to guide their clients' cloud journey IT executives who want to harvest the full benefits of cloud computing Business executives who align organizational changes with the technical transformation NOTE: This book is currently available on Amazon as a print book only. The DRM-free ebook in all formats and more information are available at CloudStrategyBook.com"
}